<a href="https://colab.research.google.com/github/shubham-dalmia/pandas-exercise/blob/main/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Import pandas under the alias pd.

In [90]:
import numpy as np
import pandas as pd


2. Print the version of pandas that has been imported.

In [91]:
pd.__version__

'1.1.5'


3. Print out all the version information of the libraries that are required by the pandas library.

In [92]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : b5958ee1999e9aead1938c0bba2b674378807b3d
python           : 3.7.12.final.0
python-bits      : 64
OS               : Linux
OS-release       : 5.4.104+
Version          : #1 SMP Sat Jun 5 09:50:34 PDT 2021
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 1.1.5
numpy            : 1.19.5
pytz             : 2018.9
dateutil         : 2.8.2
pip              : 21.1.3
setuptools       : 57.4.0
Cython           : 0.29.24
pytest           : 3.6.4
hypothesis       : None
sphinx           : 1.8.5
blosc            : None
feather          : 0.4.1
xlsxwriter       : None
lxml.etree       : 4.2.6
html5lib         : 1.0.1
pymysql          : None
psycopg2         : 2.7.6.1 (dt dec pq3 ext lo64)
jinja2           : 2.11.3
IPython          : 5.5.0
pandas_datareader: 0.9.0
bs4              : 4.6.3
bottleneck       : 1.3.2
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.2.2
numexpr          : 2.7.3
odfpy            : None
openpyxl         : 2.5.9
pandas_gbq       : 0.13.3
pyarrow          : 3.0.0
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.4.23
tables           : 3.4.4
tabulate         : 0.8.9
xarray           : 0.18.2
xlrd             : 1.1.0
xlwt             : 1.3.0
numba            : 0.51.2

4. Create a DataFrame df from this dictionary data which has the index labels.

In [93]:
df=pd.DataFrame({'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
                 'age': [2.5, 3.0, 0.5, np.nan, 5.0, 2.0, 4.5, np.nan, 7.0, 3.0],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}, columns=['animal','age','visits','priority'])
df.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

5. Display a summary of the basic information about this DataFrame and its data (hint: there is a single method that can be called on the DataFrame).

In [94]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

6. Return the first 3 rows of the DataFrame df.

In [95]:
df.iloc[0:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

7. Select just the 'animal' and 'age' columns from the DataFrame df.

In [96]:
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0


8. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [97]:
df.loc[['d','e','i'],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

9. Select only the rows where the number of visits is greater than 3.

In [98]:
df.loc[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

10. Select the rows where the age is missing, i.e. it is NaN.

In [99]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

11. Select the rows where the animal is a cat and the age is less than 3.

In [100]:
df.loc[(df['animal']=='cat')&(df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no


12. Select the rows the age is between 2 and 4 (inclusive).

In [101]:
df.loc[(df['age']>=2)&(df['age']<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no


13. Change the age in row 'f' to 1.5.

In [102]:
df.at['f','age']=1.5

14. Calculate the sum of all visits in df (i.e. find the total number of visits).

In [103]:
df['visits'].sum()

19

15. Calculate the mean age for each different animal in df.

In [104]:
df['age'].mean()

3.375

16. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [105]:
df.loc['k'] = ['Hippo',5,4 ,'yes']
df.drop(['k'])

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

17. Count the number of each type of animal in df.

In [106]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Hippo    1
Name: animal, dtype: int64


18. Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).

In [107]:
df.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
k  Hippo  5.0       4      yes
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [108]:
df.loc[df.priority == "yes", "priority"] = "True"
df.loc[df.priority == "no", "priority"] = "False"
df

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  1.5       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False
k  Hippo  5.0       4     True

20. In the 'animal' column, change the 'snake' entries to 'python'.

In [109]:
df.loc[df.animal == "snake", "animal"] = "python"
df

   animal  age  visits priority
a     cat  2.5       1     True
b     cat  3.0       3     True
c  python  0.5       2    False
d     dog  NaN       3     True
e     dog  5.0       2    False
f     cat  1.5       3    False
g  python  4.5       1    False
h     cat  NaN       1     True
i     dog  7.0       2    False
j     dog  3.0       1    False
k   Hippo  5.0       4     True

21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [110]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2     3    4
animal
Hippo   NaN  NaN   NaN  5.0
cat     2.5  NaN  2.25  NaN
dog     3.0  6.0   NaN  NaN
python  4.5  0.5   NaN  NaN

22. You have a DataFrame df with a column 'A' of integers. For example:

df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

1, 2, 3, 4, 5, 6, 7

In [151]:
dif = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
print(dif['A'].unique())

[1 2 3 4 5 6 7]

23. Given a DataFrame of numeric values, say

diff = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
how do you subtract the row mean from each element in the row?

In [138]:
diff=pd.DataFrame(np.random.rand(5, 3))
print(diff)
#print(diff.mean(axis=1))
diff.sub(diff.mean(axis=1), axis=0)

          0         1         2
0  0.492561  0.725892  0.845799
1  0.979905  0.687140  0.964666
2  0.247230  0.808244  0.752840
3  0.218640  0.504803  0.911355
4  0.753241  0.692409  0.321779

          0         1         2
0 -0.195523  0.037808  0.157715
1  0.102668 -0.190097  0.087429
2 -0.355541  0.205473  0.150069
3 -0.326292 -0.040130  0.366422
4  0.164098  0.103266 -0.267364

24. Suppose you have DataFrame with 10 columns of real numbers, for example:

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
Which column of numbers has the smallest sum? Return that column's label.

In [153]:
duf = pd.DataFrame(np.random.rand(5, 10),columns=['a','b','c','d','e','f','g','h','i','j'])
print(duf)
duf.sum().idxmin()

          a         b         c  ...         h         i         j
0  0.197046  0.580798  0.080301  ...  0.685983  0.452986  0.491553
1  0.127110  0.393379  0.718962  ...  0.992727  0.281090  0.040341
2  0.931978  0.368598  0.195948  ...  0.763873  0.362350  0.808225
3  0.893379  0.719130  0.437970  ...  0.649439  0.342787  0.989812
4  0.387821  0.476579  0.118823  ...  0.992728  0.633669  0.742158

[5 rows x 10 columns]

'c'